---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SketchedShapeNotAvailable
source: html/d17d0f71-7a32-deb6-df33-c2b95029ef87.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SketchedShapeNotAvailable Property

Skeched shape is not available for this type of element.

## Syntax (C#)
```csharp
public static FailureDefinitionId SketchedShapeNotAvailable { get; }
```